# Rebar Crank Type Utils Methods

Source: https://www.revitapidocs.com/2026/18a30ea5-4769-0c2a-1aa4-ef22f33bde3d.htm

---

| Rebar Crank Type Utils Methods |
| --- |

The RebarCrankTypeUtils type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | CreateRebarCrankType | Creates a Rebar Crank Type element. |
|  | GetAllRebarCrankTypes | Gets all the Rebar Crank Types elements from the document. |
|  | GetCrankLengthMultiplier | Gets the crank length multiplier value. |
|  | GetCrankOffsetMultiplier | Gets the crank offset multiplier value. |
|  | GetCrankRatio | Gets the crank ratio value. |
|  | SetCrankLengthMultiplier | Sets the crank length multiplier value. |
|  | SetCrankOffsetMultiplier | Sets the crank offset multiplier value. |
|  | SetCrankRatio | Sets the crank ratio value. |

Top See Also

#### Reference

RebarCrankTypeUtils Class Autodesk.Revit.DB.Structure Namespace